TifaLockhart-Nora/STM32F407ZGT6/Core/Src/lcd.c
        if (lcddev.id == 0x8552)        /* ½«8552µÄID×ª»»³É7789 */
        {
            lcddev.id = 0x7789;
        }

        if (lcddev.id != 0x7789)        /* Ò²²»ÊÇST7789, ³¢ÊÔÊÇ²»ÊÇ NT35310 */
        {
            lcd_wr_regno(0xD4);
            lcddev.id = lcd_rd_data();  /* dummy read */
            lcddev.id = lcd_rd_data();  /* ¶Á»Ø0x01 */
            lcddev.id = lcd_rd_data();  /* ¶Á»Ø0x53 */
            lcddev.id <<= 8;
            lcddev.id |= lcd_rd_data(); /* ÕâÀï¶Á»Ø0x10 */

            if (lcddev.id != 0x5310)    /* Ò²²»ÊÇNT35310,³¢ÊÔ¿´¿´ÊÇ²»ÊÇST7796 */
            {
                lcd_wr_regno(0XD3);
                lcddev.id = lcd_rd_data();  /* dummy read */
                lcddev.id = lcd_rd_data();  /* ¶Áµ½0X00 */
                lcddev.id = lcd_rd_data();  /* ¶ÁÈ¡0X77 */
                lcddev.id <<= 8;
                lcddev.id |= lcd_rd_data(); /* ¶ÁÈ¡0X96 */
                
                if (lcddev.id != 0x7796)    /* Ò²²»ÊÇST7796,³¢ÊÔ¿´¿´ÊÇ²»ÊÇNT35510 */
                {
                    /* ·¢ËÍÃÜÔ¿£¨³§¼ÒÌá¹©£© */
                    lcd_write_reg(0xF000, 0x0055);
                    lcd_write_reg(0xF001, 0x00AA);
                    lcd_write_reg(0xF002, 0x0052);
                    lcd_write_reg(0xF003, 0x0008);
                    lcd_write_reg(0xF004, 0x0001);
                    
                    lcd_wr_regno(0xC500);       /* ¶ÁÈ¡IDµÍ°ËÎ» */
                    lcddev.id = lcd_rd_data();  /* ¶Á»Ø0x80 */
                    lcddev.id <<= 8;

                    lcd_wr_regno(0xC501);       /* ¶ÁÈ¡ID¸ß°ËÎ» */
                    lcddev.id |= lcd_rd_data(); /* ¶Á»Ø0x00 */
                    
                    HAL_Delay(5);                /* µÈ´ý5ms, ÒòÎª0XC501Ö¸Áî¶Ô1963À´Ëµ¾ÍÊÇÈí¼þ¸´Î»Ö¸Áî, µÈ´ý5msÈÃ1963¸´Î»Íê³ÉÔÙ²Ù×÷ */

                    if (lcddev.id != 0x5510)    /* Ò²²»ÊÇNT5510,³¢ÊÔ¿´¿´ÊÇ²»ÊÇILI9806 */
                    {
                        lcd_wr_regno(0XD3);
                        lcddev.id = lcd_rd_data();  /* dummy read */
                        lcddev.id = lcd_rd_data();  /* ¶Á»Ø0X00 */
                        lcddev.id = lcd_rd_data();  /* ¶Á»Ø0X98 */
                        lcddev.id <<= 8;
                        lcddev.id |= lcd_rd_data(); /* ¶Á»Ø0X06 */
                        
                        if (lcddev.id != 0x9806)    /* Ò²²»ÊÇILI9806,³¢ÊÔ¿´¿´ÊÇ²»ÊÇSSD1963 */
                        {
                            lcd_wr_regno(0xA1);
                            lcddev.id = lcd_rd_data();
                            lcddev.id = lcd_rd_data();  /* ¶Á»Ø0x57 */
                            lcddev.id <<= 8;
                            lcddev.id |= lcd_rd_data(); /* ¶Á»Ø0x61 */

                            if (lcddev.id == 0x5761) lcddev.id = 0x1963; /* SSD1963¶Á»ØµÄIDÊÇ5761H,Îª·½±ãÇø·Ö,ÎÒÃÇÇ¿ÖÆÉèÖÃÎª1963 */
                        }
                    }
                }
            }
        }
    }


    /* 特别注意, 如果在main函数里面屏蔽串口1初始化, 则会卡死在printf
     * 里面(卡死在f_putc函数), 所以, 必须初始化串口1, 或者屏蔽掉下面
     * 这行 printf 语句 !!!!!!!
     */
    LOG_INFO("LCD ID:0x%x\r\n", lcddev.id); /* 打印LCD ID */

    if (lcddev.id == 0x7789)
    {
        lcd_ex_st7789_reginit();    /* Ö´ÐÐST7789³õÊ¼»¯ */
    }
    else if (lcddev.id == 0x9341)
    {
        lcd_ex_ili9341_reginit();   /* Ö´ÐÐILI9341³õÊ¼»¯ */
    }
    else if (lcddev.id == 0x5310)
    {
        lcd_ex_nt35310_reginit();   /* Ö´ÐÐNT35310³õÊ¼»¯ */
    }
    else if (lcddev.id == 0x7796)
    {
        lcd_ex_st7796_reginit();    /* Ö´ÐÐST7796³õÊ¼»¯ */
    }
    else if (lcddev.id == 0x5510)
    {
        lcd_ex_nt35510_reginit();   /* Ö´ÐÐNT35510³õÊ¼»¯ */
    }
    else if (lcddev.id == 0x9806)
    {
        lcd_ex_ili9806_reginit();   /* Ö´ÐÐILI9806³õÊ¼»¯ */
    }
    else if (lcddev.id == 0x1963)
    {
        lcd_ex_ssd1963_reginit();   /* Ö´ÐÐSSD1963³õÊ¼»¯ */
        lcd_ssd_backlight_set(100); /* ±³¹âÉèÖÃÎª×îÁÁ */
    }

    FSMC_NORSRAM_TimingTypeDef fsmc_write_handle = {0};
    extern SRAM_HandleTypeDef hsram1;
        /* ³õÊ¼»¯Íê³ÉÒÔºó,ÌáËÙ */
    if (lcddev.id == 0x7789 || lcddev.id == 0x9341 || lcddev.id == 0x1963)  /* 7789/9341/1963 ÌáËÙ */
    {
        /* ÖØÐÂÅäÖÃÐ´Ê±Ðò¿ØÖÆ¼Ä´æÆ÷µÄÊ±Ðò */
        fsmc_write_handle.AddressSetupTime = 3; /* µØÖ·½¨Á¢Ê±¼ä(ADDSET)Îª3¸öfsmc_ker_ck=6*3=18ns */
        fsmc_write_handle.DataSetupTime = 3;    /* Êý¾Ý±£³ÖÊ±¼ä(DATAST)Îª3¸öfsmc_ker_ck=6*3=18ns */
        FSMC_NORSRAM_Extended_Timing_Init(hsram1.Extended, &fsmc_write_handle, hsram1.Init.NSBank, hsram1.Init.ExtendedMode);
    }
    else if (lcddev.id == 0x5310 || lcddev.id == 0x7796 || lcddev.id == 0x5510 || lcddev.id == 0x9806)  /* Èç¹ûÊÇÕâ¼¸¸öIC, ÔòÉèÖÃWRÊ±ÐòÎª×î¿ì */
    {
        /* ÖØÐÂÅäÖÃÐ´Ê±Ðò¿ØÖÆ¼Ä´æÆ÷µÄÊ±Ðò */
        fsmc_write_handle.AddressSetupTime = 2; /* µØÖ·½¨Á¢Ê±¼ä(ADDSET)Îª2¸öfsmc_ker_ck=6*2=12ns */
        fsmc_write_handle.DataSetupTime = 2;    /* Êý¾Ý±£³ÖÊ±¼ä(DATAST)Îª2¸öfsmc_ker_ck=6*2=12ns */
        FSMC_NORSRAM_Extended_Timing_Init(hsram1.Extended, &fsmc_write_handle, hsram1.Init.NSBank, hsram1.Init.ExtendedMode);
    }

    lcd_display_dir(0); /* 默认为竖屏 */
    LCD_BL(1);          /* 点亮背光 */
    // lcd_clear(BLUE);
}

/**
 * @brief       清屏函数
 * @param       color: 要清屏的颜色
 * @retval      无
 */
void lcd_clear(uint16_t color)
{
    uint32_t index = 0;
    uint32_t totalpoint = lcddev.width;

    totalpoint *= lcddev.height;  /* 得到总点数 */
    lcd_set_cursor(0x00, 0x0000); /* 设置光标位置 */
    lcd_write_ram_prepare();      /* 开始写入GRAM */

    for (index = 0; index < totalpoint; index++)
    {
        LCD->LCD_RAM = color;
    }
}

/**
 * @brief       在指定区域内填充单个颜色
 * @param       (sx,sy),(ex,ey):填充矩形对角坐标,区域大小为:(ex - sx + 1) * (ey - sy + 1)
 * @param       color:  要填充的颜色(32位颜色,方便兼容LTDC)
 * @retval      无
 */
void lcd_fill(uint16_t sx, uint16_t sy, uint16_t ex, uint16_t ey, uint32_t color)
{
    uint16_t i, j;
    uint16_t xlen = 0;
    xlen = ex - sx + 1;

    for (i = sy; i <= ey; i++)
    {
        lcd_set_cursor(sx, i);   /* 设置光标位置 */
        lcd_write_ram_prepare(); /* 开始写入GRAM */

        for (j = 0; j < xlen; j++)
        {
            LCD->LCD_RAM = color; /* 显示颜色 */
        }
    }
}

/**
 * @brief       在指定区域内填充指定颜色块
 * @param       (sx,sy),(ex,ey):填充矩形对角坐标,区域大小为:(ex - sx + 1) * (ey - sy + 1)
 * @param       color: 要填充的颜色数组首地址
 * @retval      无
 */
void lcd_color_fill(uint16_t sx, uint16_t sy, uint16_t ex, uint16_t ey, uint16_t *color)
{
    uint16_t height, width;
    uint16_t i, j;

    width = ex - sx + 1;  /* 得到填充的宽度 */
    height = ey - sy + 1; /* 高度 */

    for (i = 0; i < height; i++)
    {
        lcd_set_cursor(sx, sy + i); /* 设置光标位置 */
        lcd_write_ram_prepare();    /* 开始写入GRAM */

